app/Models/PlayerModel.php

    public function getPlayers($slug = false)
    {
        if ($slug === false) {
            $sql = $this->select('jugadores.*,liga.*');
            $sql = $this->join('liga', 'jugadores.liga=liga.id-liga');
            $sql = $this->findAll();
            return $sql;
        }
        $sql = $this->select('jugadores.*,liga.nombre');
        $sql = $this->join('liga', 'jugadores.liga=liga.id-liga');
        $sql = $this->where(['slug' => $slug]);
        $sql = $this->first();
---
SELECT `jugadores`.*, `liga`.*
FROM `jugadores`
JOIN `liga` ON `jugadores`.`liga`=`liga`.`id-liga`
SELECT *
FROM `liga`